# 我的第一个实用程序：简易记账本
print("="*30)
print("    欢迎使用简易记账本")
print("="*30)
# 先设置一个初始金额（假设你钱包里有500块）
余额 = 0
print(f"你当前拥有{余额}元")
#用while循环让程序可以重复记账
while True:
    print("\n"+"-"*20)
    print("请选择操作：")
    print("1.记录支出")
    print("2.记录收入")
    print("3.查看余额")
    print("4.退出程序")

    选择 = input("请输入数字（1-4）:")

    if 选择 == "1":
          支出 = float(input("花了多少钱:"))
          余额 = 余额 - 支出
          print(f"支出{支出}元,当前余额：{余额}元")

    elif 选择 =="2":
        
            收入= float(input("进了多少钱："))
            余额=余额+收入
            print(f"收入{收入}元,当前余额:{余额}元")

    elif 选择 =="3":
            print (f"当前余额：{余额}元")

    elif 选择 == "4":
            print ("感谢使用，再见！")
            break

    else:
            print("输入有误，请输入1-4的数字！")
